[
  {
    "title": "工程知识",
    "statement": "能够将数学、自然科学、工程基础和专业知识用于解决复杂工程问题",
    "children":
    [
      { "statement": "掌握数学、自然科学、工程科学和计算机专业的基础知识、原理和方法" },
      { "statement": "能使用数学、自然科学、工程科学和计算机专业的语言工具表述计算机领域的复杂工程问题并求解" },
      { "statement": "能利用相关知识和数学模型方法推演、分析计算机领域的复杂工程问题" },
      { "statement": "能利用相关知识比较、综合和优化计算机工程问题的解决方案" }
    ]
  },
  {
    "title": "问题分析",
    "statement": "能够应用数学、自然科学和工程科学的基本原理，识别、表达、并通过文献研究分析复杂工程问题，以获得有效结论",
    "children":
    [
      { "statement": "掌握数学、自然科学和工程科学的基本原理，掌握文献检索与研究的方法和技巧" },
      { "statement": "能应用数学、自然科学和工程科学的基本原理识别计算机领域复杂工程问题的关键环节，能正确表述复杂的计算机工程问题" },
      { "statement": "能应用基本原理，会借助文献研究、分析、解决工程问题，获得多种可选的解决方案" }
    ]
  },
  {
    "title": "设计/开发解决方案",
    "statement": "能够设计针对复杂工程问题的解决方案，设计满足特定需求的系统、单元（部件）或工艺流程，并能够在设计环节中体现创新意",
    "children":
    [
      { "statement": "掌握计算机领域工程设计与产品开发全周期、全流程的基本设计/开发方法和，了解影响设计目标和技术方案的各种因素" },
      { "statement": "针对计算机领域复杂工程问题，设计满足特定需求的系统、单元或流程的能力" },
      { "statement": "在计算机领域设计环节中体现创新意识，并综合考虑社会、健康、安全、法律、文化以及环境等因素的能力" }
    ]
  },
  {
    "title": "研究",
    "statement": "能够基于科学原理并采用科学方法对复杂工程问题进行研究，包括设计实验、分析与解释数据、并通过信息综合得到合理有效的结论",
    "children":
    [
      { "statement": "通过文献研究或相关方法，调研和分析计算机领域复杂工程问题的解决方案" },
      { "statement": "能够根据计算机领域对象特征，选择研究路线，设计实验方案" },
      { "statement": "能够根据实验方案构建计算机领域实验系统，安全地开展实验，科学地采集实验数据" },
      { "statement": "能对实验结果进行分析和解释，并通过信息综合得到合理有效地结论" }
    ]
  },
  {
    "title": "使用现代工具",
    "statement": "能够针对复杂工程问题，开发、选择与使用恰当的技术、资源、现代工程工具和信息技术工具，包括对复杂工程问题的预测与模拟，并能够理解其局限性",
    "children":
    [
      { "statement": "了解计算机领域常用的现代仪器、信息技术工具、工程工具和模拟软件的使用原理和方法，并理解其局限性" },
      { "statement": "能够选择与使用恰当的仪器、信息资源、工程工具和专业模拟软件，对计算机领域复杂工程问题进行分析、计算与设计" },
      { "statement": "能够针对计算机领域具体的对象，开发或选用满足特定需求的现代工具，模拟和预测专业问题，并能够分析其局限性" }
    ]
  },
  {
    "title": "工程与社会",
    "statement": "能够基于工程相关背景知识进行合理分析，评价专业工程实践和复杂工程问题解决方案对社会、健康、安全、法律以及文化的影响，并理解应承担的责任",
    "children":
    [
      { "statement": "了解计算机专业相关领域的技术标准体系、知识产权、产业政策和法律法规，不同社会文化对工程活动的影响" },
      { "statement": "能分析和评价计算机领域专业实践对社会、健康、安全、法律以及文化的影响，并理解应承担的责任" }
    ]
  },
  {
    "title": "环境和可持续发展",
    "statement": "能够理解和评价针对复杂工程问题的工程实践对环境、社会可持续发展的影响",
    "children":
    [
      { "statement": "知晓和理解环境保护和可持续发展的理念和内涵" },
      { "statement": "能够站在环境保护和可持续发展的角度思考计算机领域专业工程实践的可持续性，评价产品周期中可能对人类和环境在城的损害和隐患" }
    ]
  },
  {
    "title": "职业规范",
    "statement": "具有人文社会科学素养、社会责任感，能够在工程实践中理解并遵守工程职业道德和规范，履行责任",
    "children":
    [
      { "statement": "有正确的价值观，理解个人与社会的关系，了解中国国情" },
      { "statement": "理解诚实公正、诚信守则的过程职业道德规范，并能在计算机领域工程实践中自觉遵守" },
      { "statement": "理解并遵守计算机领域工程职业道德和规范" }
    ]
  },
  {
    "title": "个人和团队",
    "statement": "能够在多学科背景下的团队中承担个体、团队成员以及负责人的角色",
    "children":
    [
      { "statement": "能与其他学科的成员有效沟通，合作共享" },
      { "statement": "能够在计算机领域团队中独立或合作开展工作" },
      { "statement": "能够组织、协调和指挥计算机领域团队开展工作" }
    ]
  },
  {
    "title": "沟通",
    "statement": "能够就复杂工程问题与业界同行及社会公众进行有效沟通和交流，包括撰写报告和设计文稿、陈述发言、清晰表达或回应指令。并具备一定的国际视野，能够在跨文化背景下进行沟通和交流",
    "children":
    [
      { "statement": "能就计算机领域专业问题，以口头、文稿、图表等方式，准确表达自己的观点，回应质疑，理解与业界同行和社会公众交流的差异性" },
      { "statement": "关注全球性问题，理解和尊重世界不同文化的差异性和多样性，理解计算机领域的国际发展趋势、研究热点" },
      { "statement": "具有款文化的语言和书面交流能力，能救计算机领域专业问题，在款文化的背景下机型基本的沟通和交流" }
    ]
  },
  {
    "title": "项目管理",
    "statement": "理解并掌握工程管理原理与经济决策方法，并能在多学科环境中应用",
    "children":
    [
      { "statement": "理解计算机领域工程及产品全周期、全流程的成本构成中涉及构成管理与经济决策问题" },
      { "statement": "掌握计算机领域工程项目中涉及的管理与经济决策方法、项目管理知识与管理工具" },
      { "statement": "能在多学科环境中，应用计算机工程管理与经济决策方法" }
    ]
  },
  {
    "title": "终身学习",
    "statement": "具有自主学习和终身学习的意识，有不断学习和适应发展的能力",
    "children":
    [
      { "statement": "具有自主学习和终身学习的意识， 具有不断学习和适应发展的能力" }
    ]
  }
]